In [3]:
import numpy as np
import pandas as pd
import seaborn as sns

# 1.

# 2.

In [ ]:
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
# 1.a. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. category1 카테고리는 다음과 같이 정의됨\
# 1) 20살이 넘으면 성별을 그대로 사용한다.
# 2) 20살 미만이면 성별에 관계없이 “child”라고 한다.
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age >= 20 else 'child', axis= 1)
titanic.head()

   survived  pclass     sex   age  ...  embark_town  alive  alone category1
0         0       3    male  22.0  ...  Southampton     no  False      male
1         1       1  female  38.0  ...    Cherbourg    yes  False    female
2         1       3  female  26.0  ...  Southampton    yes   True    female
3         1       1  female  35.0  ...  Southampton    yes  False    female
4         0       3    male  35.0  ...  Southampton     no   True      male

[5 rows x 16 columns]

In [ ]:
# 2.타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값
이 되도록 titanic 데이터프레임을 고치시오.
titanic.age.fillna(titanic.age.mean(),inplace=True)
titanic.tail()

     survived  pclass     sex        age  ...  embark_town  alive  alone category1
886         0       2    male  27.000000  ...  Southampton     no   True      male
887         1       1  female  19.000000  ...  Southampton    yes   True     child
888         0       3  female  29.699118  ...  Southampton     no  False     child
889         1       1    male  26.000000  ...    Cherbourg    yes   True      male
890         0       3    male  32.000000  ...   Queenstown     no   True      male

[5 rows x 16 columns]

In [ ]:
# 3.성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.
rate_survived = titanic.groupby(['sex','pclass','embark_town'])['survived'].mean()

In [ ]:
rate_survived

sex     pclass  embark_town
female  1       Cherbourg      0.976744
                Queenstown     1.000000
                Southampton    0.958333
        2       Cherbourg      1.000000
                Queenstown     1.000000
                Southampton    0.910448
        3       Cherbourg      0.652174
                Queenstown     0.727273
                Southampton    0.375000
male    1       Cherbourg      0.404762
                Queenstown     0.000000
                Southampton    0.354430
        2       Cherbourg      0.200000
                Queenstown     0.000000
                Southampton    0.154639
        3       Cherbourg      0.232558
                Queenstown     0.076923
                Southampton    0.128302
Name: survived, dtype: float64

In [ ]:
# 4
pd.cut(titanic.age,bins=bins,labels=labels)

0        청년
1        중년
2        청년
3        중년
4        중년
       ...
886      청년
887    미성년자
888      청년
889      청년
890      중년
Name: age, Length: 891, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [ ]:
titanic['나이'] = pd.cut(titanic.age,bins=bins,labels=labels)

In [ ]:
titanic.groupby('나이')[['survived']].mean()

      survived
나이
미성년자  0.424242
청년    0.334152
중년    0.423237
장년    0.355932
노년    0.200000

In [ ]:
# 5. qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

In [ ]:
pd.qcut(titanic.age, 3,labels = ['첫번째','두번째','세번째'])

0      첫번째
1      세번째
2      두번째
3      세번째
4      세번째
      ...
886    두번째
887    첫번째
888    두번째
889    두번째
890    세번째
Name: age, Length: 891, dtype: category
Categories (3, object): ['첫번째' < '두번째' < '세번째']

In [ ]:
titanic.groupby([pd.qcut(titanic.age, 3),'sex'])[['survived']].mean()

                      survived
age           sex
(0.419, 25.0] female  0.713115
              male    0.206704
(25.0, 31.0]  female  0.701031
              male    0.164251
(31.0, 80.0]  female  0.821053
              male    0.198953

In [ ]:
# gender : 남성이면 1, 여성이면 0
titanic['gender'] = titanic.apply(lambda r: 1 if r.sex == 'male' else 0, axis=1)
titanic.tail()
titanic.groupby(pd.qcut(titanic.age, 3))[['survived','gender']].mean()

               survived    gender
age
(0.419, 25.0]  0.411960  0.594684
(25.0, 31.0]   0.335526  0.680921
(31.0, 80.0]   0.405594  0.667832

# 3.

In [4]:
# 1.배기량(displacement) 대비 마력(horsepower) 열(hp_per_cc)을 추가하시오.
mpg = sns.load_dataset('mpg')

In [ ]:
mpg.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [9]:
mpg['hp_per_cc'] = mpg.horsepower / mpg.displacement

In [ ]:
mpg.head()

    mpg  cylinders  displacement  ...  origin                       name  hp_per_cc
0  18.0          8         307.0  ...     usa  chevrolet chevelle malibu   0.423453
1  15.0          8         350.0  ...     usa          buick skylark 320   0.471429
2  18.0          8         318.0  ...     usa         plymouth satellite   0.471698
3  16.0          8         304.0  ...     usa              amc rebel sst   0.493421
4  17.0          8         302.0  ...     usa                ford torino   0.463576

[5 rows x 10 columns]

In [6]:
#2 name으로부터 manufacturer(제조사)와 모델을 추출하여
#  새로운 열 manufacturer와 model을 추가하고, name 열은 삭제하시오.
mpg['manufacturer'] = mpg.name.apply(lambda x: x.split()[0])
mpg['model'] = mpg.name.apply(lambda x: ' '.join(x.split()[1:]))
del mpg['name']
mpg.head()

    mpg  cylinders  displacement  ...  origin  manufacturer            model
0  18.0          8         307.0  ...     usa     chevrolet  chevelle malibu
1  15.0          8         350.0  ...     usa         buick      skylark 320
2  18.0          8         318.0  ...     usa      plymouth        satellite
3  16.0          8         304.0  ...     usa           amc        rebel sst
4  17.0          8         302.0  ...     usa          ford           torino

[5 rows x 10 columns]

In [7]:
# 3. 엔진의 실린더(cylinders) 갯수별 연비(mpg)의 평균을 구하시오.
mpg.groupby('cylinders')[['mpg']].mean()

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [10]:
# 4.생산지(origin)별 배기량 대비 마력(hp_per_cc)의 평균을 구하시오.
mpg.groupby('origin')[['hp_per_cc']].mean()

        hp_per_cc
origin
europe   0.740005
japan    0.789485
usa      0.512063

In [16]:
# 5. 모델이 5개 이상인 제조사에 대하여
#    연비(mpg)의 평균이 가장 좋은 제조사 Top 5를 구하시오.
s = mpg.manufacturer.value_counts()
big = s[s >= 5].index.tolist()
print(big)

['ford', 'chevrolet', 'plymouth', 'amc', 'dodge', 'toyota', 'datsun', 'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'oldsmobile', 'mazda', 'fiat', 'peugeot', 'audi', 'vw', 'volvo', 'chrysler', 'renault']

In [20]:
big_mpg = mpg[mpg.manufacturer.isin(big)]
big_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg', ascending = False).head(5)

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000

In [21]:
# filter 사용
mpg.groupby('manufacturer').filter(lambda x: x.manufacturer.count() >= 5).head()

    mpg  cylinders  displacement  ...  manufacturer            model  hp_per_cc
0  18.0          8         307.0  ...     chevrolet  chevelle malibu   0.423453
1  15.0          8         350.0  ...         buick      skylark 320   0.471429
2  18.0          8         318.0  ...      plymouth        satellite   0.471698
3  16.0          8         304.0  ...           amc        rebel sst   0.493421
4  17.0          8         302.0  ...          ford           torino   0.463576

[5 rows x 11 columns]

In [22]:
n_mpg = mpg.groupby('manufacturer').filter(lambda x: x.manufacturer.count() >= 5)
n_mpg.pivot_table('mpg','manufacturer').sort_values(by='mpg', ascending = False).head(5)

                    mpg
manufacturer
vw            39.016667
honda         33.761538
renault       32.880000
datsun        31.113043
mazda         30.860000

#강사님 답

In [ ]:
# 1-1
iris = sns.load_dataset('iris')
iris.groupby('species').agg(['mean','std'])

           sepal_length           sepal_width  ... petal_length petal_width
                   mean       std        mean  ...          std        mean       std
species                                        ...
setosa            5.006  0.352490       3.428  ...     0.173664       0.246  0.105386
versicolor        5.936  0.516171       2.770  ...     0.469911       1.326  0.197753
virginica         6.588  0.635880       2.974  ...     0.551895       2.026  0.274650

[3 rows x 8 columns]

In [ ]:
# 1-2
s = iris[iris.species == 'setosa']['sepal_width']
q1, q3 = s.quantile(.25), s.quantile(.75)
iqr = q3 - q1
q1, q3, iqr

(3.2, 3.6750000000000003, 0.4750000000000001)

In [ ]:
lower = q1 - 1.5 * iqr
upper = q3 + 1.5 * iqr
s[(s < lower) | (s > upper)] = np.nan
s.isnull().sum()

/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)

2

In [ ]:
def get_new_stat(s):
  q1, q3 = s.quantile(.25), s.quantile(.75)
  iqr = q3 - q1
  lower = q1 - 1.5 * iqr
  upper = q3 + 1.5 * iqr
  s[(s < lower) | (s > upper)] = np.nan
  outlier = s.isnull().sum() != 0
  return outlier, np.round(s.mean(),2), np.round(s.std(),4)

species_list, feature_list, mean_list, std_list = [],[],[],[]
outlier_list, new_mean_list, new_std_list = [], [], []
for species in iris.species.unique():
  for feature in iris.columns[:-1]:
    s = iris[iris.species == species][feature]
    species_list.append(species)
    feature_list.append(feature)
    mean_list.append(np.round(s.mean(),2))
    std_list.append(np.round(s.std(),4))
    outlier, new_mean, new_std = get_new_stat(s)
    outlier_list.append(outlier)
    new_mean_list.append(new_mean)
    new_std_list.append(new_std)
pf = pd.DataFrame({
    'species': species_list,'feature': feature_list,
    'mean': mean_list, 'std': std_list,
    'outlier': outlier_list,
    'new_mean': new_mean_list,
    'new_std': new_std_list
})
pf.set_index(['species','feature'], inplace = True)
pf

/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)
/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:1021: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(~key, value, inplace=True)

                         mean     std  outlier  new_mean  new_std
species    feature
setosa     sepal_length  5.01  0.3525    False      5.01   0.3525
           sepal_width   3.43  0.3791     True      3.43   0.3203
           petal_length  1.46  0.1737     True      1.46   0.1291
           petal_width   0.25  0.1054     True      0.23   0.0859
versicolor sepal_length  5.94  0.5162    False      5.94   0.5162
           sepal_width   2.77  0.3138    False      2.77   0.3138
           petal_length  4.26  0.4699     True      4.29   0.4378
           petal_width   1.33  0.1978    False      1.33   0.1978
virginica  sepal_length  6.59  0.6359     True      6.62   0.5935
           sepal_width   2.97  0.3225     True      2.96   0.2603
           petal_length  5.55  0.5519    False      5.55   0.5519
           petal_width   2.03  0.2747    False      2.03   0.2747

In [ ]:
# 2-1